{
    "headerlink":{
        "link1":"HOME",
        "link2":"ABOUT",
        "link3":"SKILLS",
        "link4":"PROJECTS",
        "link5":"CONTACT"
    },
    "presentation":{
        "title":"HELLO, WELCOME TO MY PORTFOLIO OF WEB DEVELOPER",
        "paragrahe":"My name is Mahmoudou Abdoul Nganiyyou and i'm a Result-Oriented fullstack Developer building and managing Websites and Web Applications that leads to the success of the overall product",
        "cv":"Download my CV"
    },
    "changeLangage":"Change langage",
    "about":{
        "title":"ABOUT ME",
        "subtitle":"Here you will find more information about me, what I do, and my current skills mostly in terms of programming and technology",
        "paragraphe":{
            "p1":"Fresh out of a training for the web developer path on",
            "p2":"I am more focused on the front-end but I also master the back end side with NodeJS and MongoDB. Discover some of my work that I was able to achieve during my training in the",
            "link1":"projects",
            "p3":"I also like to share content related to things I have learned over the years in web development so that it can help other people in the Dev community. Feel free to connect or follow me on my",
            "p4":"and",
            "p5":"where I publish useful content related to web development and programming. I am open to job opportunities where I can contribute, learn and grow. If you have a good opportunity that matches my skills and experience, do not hesitate to",
            "link2":"contact"
        }
    },
    "skills":"SKILLS",
    "projects":"PROJECTS",
    "cardProjet":"View project",
    "project":{
        "title1":"project",
        "title2":"Pictures of the project",
        "linkProjet":"This project is here",
        "linkFolderProject":"Download the files of the project here",
        "skillsDeveloped":"Skills developed",
        "descriptionOfTheProject":"Description of the project",
        "ProblemEncountered":"Problem encountered"
    },
    "contact":{
        "paragraphe":"Feel free to Contact me by mail or by submitting the form below and I will get back to you as soon as possible",
        "email":"My Email",
        "copy": "Copied to clipboard",
        "form":{
            "title":"Form to submit",
            "name":"Name",
            "phname":"Enter your name",
            "phEmail":"Enter your email",
            "titleProject":"Title of your project",
            "phTitleProject":"Enter the title of your project",
            "phMsg":"Enter your message",
            "submit":"submit"
        }
    },
    "footer":"all rights reserved"
}